 <div class="row">
        <div class="col-lg-9">
            <h1>580.Count Student Number in Departments</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>A university uses 2 data tables, <b><i>student</i></b> and <b><i>department3</i></b>, to store data about its students and the departments associated with each major.</p>

<p>Write a query to print the respective department name and number of students majoring in each department for all departments in the <b><i>department</i></b> table (even ones with no current students).</p>

<p>Sort your results by descending number of students; if two or more departments have the same number of students, then sort those departments alphabetically by department name.</p>

<p>The <b><i>student</i></b> is described as follow:</p>

<pre>
| Column Name  | Type      |
|--------------|-----------|
| student_id   | Integer   |
| student_name | String    |
| gender       | Character |
| dept_id      | Integer   |
</pre>

<p>where student_id is the student&#39;s ID number, student_name is the student&#39;s name, gender is their gender, and dept_id is the department ID associated with their declared major.</p>

<p>And the <b><i>department3</i></b> table is described as below:</p>

<pre>
| Column Name | Type    |
|-------------|---------|
| dept_id     | Integer |
| dept_name   | String  |
</pre>

<p>where dept_id is the department&#39;s ID number and dept_name is the department name.</p>

<p>Here is an example <b>input</b>:<br />
<b><i>student</i></b> table:</p>

<pre>
| student_id | student_name | gender | dept_id |
|------------|--------------|--------|---------|
| 1          | Jack         | M      | 1       |
| 2          | Jane         | F      | 1       |
| 3          | Mark         | M      | 2       |
</pre>

<p><b><i>department3</i></b> table:</p>

<pre>
| dept_id | dept_name   |
|---------|-------------|
| 1       | Engineering |
| 2       | Science     |
| 3       | Law         |
</pre>

<p>The <b>Output</b> should be:</p>

<pre>
| dept_name   | student_number |
|-------------|----------------|
| Engineering | 2              |
| Science     | 1              |
| Law         | 0              |
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
pd.read_sql_table("student", engine)

   student_id student_name gender  dept_id
0           1         Jack      M        1
1           2         Jane      F        1
2           3         Mark      M        2

In [3]:
pd.read_sql_table("department3", engine)

   dept_id    dept_name
0        1  Engineering
1        2      Science
2        3          Law

In [4]:
## Method 1: summary and then Left Join
query = '''
SELECT d.dept_name, 
       IFNULL(temp.number, 0) student_number
FROM department3 d
LEFT JOIN
    (SELECT s.dept_id, COUNT(DISTINCT s.student_id) number
     FROM student s
     GROUP BY s.dept_id) temp
ON temp.dept_id = d.dept_id
ORDER BY student_number DESC;
'''
pd.read_sql_query(query, engine)

     dept_name  student_number
0  Engineering               2
1      Science               1
2          Law               0

In [5]:
## Method 2: Left Join and then summary
query = '''
SELECT d.dept_name, 
       IFNULL(COUNT(DISTINCT s.student_id), 0) student_number
FROM department3 d
LEFT JOIN student s
ON s.dept_id = d.dept_id
GROUP BY d.dept_name
ORDER BY student_number DESC;
'''
pd.read_sql_query(query, engine)

     dept_name  student_number
0  Engineering               2
1      Science               1
2          Law               0

In [6]:
## Method 3: Subquery matching.
query = '''
SELECT d.dept_name,
       COALESCE((SELECT COUNT(DISTINCT s.student_id)
        FROM student s
        WHERE s.dept_id = d.dept_id
        GROUP BY s.dept_id), 0) student_number
FROM department3 d
ORDER BY student_number DESC;
'''
pd.read_sql_query(query, engine)

     dept_name  student_number
0  Engineering               2
1      Science               1
2          Law               0

## Note
# Time: O(nk)
# Space: O(k)

#### 1. COALESCE([value 1], [value 2],...) return the first non-null.
#### 2. IFNULL([value 1], [value 2]) return the first non-null. Only two values available.